StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986VE9x_GPIO.svd
<?xml version="1.0" encoding="utf-8"?>

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" >
  <vendor>Milandr.</vendor>                                       <!-- device vendor name -->

  <vendorID>Milandr</vendorID>                                    <!-- device vendor short name -->
  <!--#BE1-->  
  <!--name>MDR1986BE1_RST</name>
  <series>ARMCM1</series-->
  <!--#BE3-->  
  <!--name>MDR1986BE3_RST</name>
  <series>ARMCM1</series-->
  <!--#BE9x -->
  <name>MDR1986VE9x_GPIO</name>
  <series>ARMCM3</series>
  <!--#VC1 -->
  <!--name>MDR1901VC1_RST</name>
  <series>ARMCM3</series-->
  <!--#BE4 -->
  <!--name>MDR1986BE4_RST</name>
  <series>ARMCM0</series-->
  <!--#BK214 -->
  <!--name>MDR1986BK214_RST</name>
  <series>ARMCM0</series-->
  <!--#BK234 -->
  <!--name>MDR1986BK234_RST</name>
  <series>ARMCM0</series-->
  
  <version>1.6</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <!--description>ARM 32-bit Cortex-M1 Microcontroller based device, CPU clock up to 144MHz, etc. </description><!--#BE1-->
  <!--description>ARM 32-bit Cortex-M1 Microcontroller based device, CPU clock up to 80MHz, etc. </description--><!--#BE3-->
  <description>ARM 32-bit Cortex-M3 Microcontroller based device, CPU clock up to 80MHz, etc. </description><!--#BE9x-->
  <!--description>ARM 32-bit Cortex-M3 Microcontroller based device with DSP Core, CPU clock up to 100MHz, etc. </description--><!--#VC1-->  
  <!--description>ARM 32-bit Cortex-M0 Microcontroller based device, CPU clock up to 36MHz, etc. </description--><!--#BE4,#BK214,#BK234  -->

  <cpu>                      
    <!--#BE1, #BE3 -->                                     <!-- details about the cpu embedded in the device -->
    <!--name>CM1</name>
    <revision>r1p0</revision-->
    <!--#BE9x,#VC1-->
    <name>CM3</name>
    <revision>r2p1</revision>
    <!--#BE4,#BK214,#BK234-->
    <!--name>CM0</name>
    <revision>r0p0</revision-->

    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits><!--#BE9x,#VC1-->
    <!--nvicPrioBits>2</nvicPrioBits--><!--#BE1,#BE3,#BE4,#BK214,#BK234-->

    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->

  <!-- Peripherals -->
  <peripherals>
    <!-- GPIO_PORTA -->
    <peripheral>
      <name>MDR_PORTA</name>
      <version>1.0</version>
      <description>GPIO Port Control</description>
      <groupName>GPIO Ports</groupName>
      <baseAddress>0x400A8000</baseAddress>
      <!--baseAddress>0x40080000</baseAddress><!--#BE4,#BK214,#BK234-->

      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <!--size>0x2C</size--><!--#BE1,#BE3,#BK214-->
        <size>0x20</size><!--#BE9x,#BE4,#BK234,#VC1-->
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <!-- RXTX -->
        <register>
          <name>RXTX</name>
          <description>GPIO Pin Data</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
              <name>Pin_%s</name>
              <description>Pin data value</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_GPIO__PIN_DATA_</headerEnumName>
                <enumeratedValue>
                  <name>0</name>
                  <description>LOW Level Voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>HIGH Level Voltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- OE -->
        <register>
          <name>OE</name>
          <description>Output Enable Control</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
              <name>Pin_%s</name>
              <description>Pin data direction</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_GPIO__PIN_DIR_</headerEnumName>
                <enumeratedValue>
                  <name>IN</name>
                  <description>Input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>Output pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

